---
kind: type
id: T:Autodesk.Revit.DB.Electrical.PanelScheduleTemplate
source: html/cf7e5cbb-7df4-ae55-8178-f449827b5752.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleTemplate

The PanelScheduleTemplate class represents an instance of panel schedule template
 element. An instance object could be a branch panel, a switchboard or a data panel template.

## Syntax (C#)
```csharp
public class PanelScheduleTemplate : Element
```